# DATA EXPLORATION: SQL INQUIRIES

In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\ok\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\ok\anaconda3\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in c:\users\ok\anaconda3\lib\site-packages (from ipython-sql) (8.20.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\ok\anaconda3\lib\site-packages (from ipython-sql) (2.0.25)
Requirement already satisfied: sqlparse in c:\users\ok\anaconda3\lib\site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in c:\users\ok\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\ok\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ok\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ok\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: colorama in c:\users\ok\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\ok\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\ok\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\ok\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\ok\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\ok\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
# Establsihing a database connection and creating a connection and a cursor object
import pandas as pd
import csv
import sqlite3
con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [3]:
# Loading the ipython sql extension to initiate SQL magic
%load_ext sql

In [4]:
# Initiating connection between SQL magic module and the database "my_data.db"
%sql sqlite:///my_data1.db

In [5]:
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False, method="multi")

101

In [6]:
# **Note:This below code is added to remove blank rows from table**

%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#### **Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

In [7]:
# Task 1: Display the names of the unique launch sites  in the space mission.
%sql select distinct("Launch_Site") from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

In [8]:
# Task 2:  Display 5 records where launch sites begin with the string 'CCA'

%sql SELECT * FROM SPACEXTABLE WHERE "Launch_Site" LIKE 'CCA%' \
limit 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

In [9]:
%sql select Customer, sum(PAYLOAD_MASS__KG_) AS TOTAL_MASS \
   from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('SpaceX', 619967)]

In [10]:
# Task 4: Display average payload mass carried by booster version F9 v1.1
# F9 v1.1

%sql select avg(PAYLOAD_MASS__KG_) \
   from SPACEXTABLE \
   where "Booster_Version" = 'F9 v1.1'

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

In [11]:
# Task 5: List the date when the first succesful landing outcome in ground pad was acheived.
%sql select distinct("Landing_Outcome") from SPACEXTABLE
# Success (ground pad)
%sql select Date, "Landing_Outcome" from SPACEXTABLE \
   where "Landing_Outcome" = 'Success (ground pad)' \
   order by Date

 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
Done.

[('2015-12-22', 'Success (ground pad)'),
 ('2016-07-18', 'Success (ground pad)'),
 ('2017-02-19', 'Success (ground pad)'),
 ('2017-05-01', 'Success (ground pad)'),
 ('2017-06-03', 'Success (ground pad)'),
 ('2017-08-14', 'Success (ground pad)'),
 ('2017-09-07', 'Success (ground pad)'),
 ('2017-12-15', 'Success (ground pad)'),
 ('2018-01-08', 'Success (ground pad)')]

In [12]:
%sql select min(Date), "Landing_Outcome" from SPACEXTABLE \
   where "Landing_Outcome" = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('2015-12-22', 'Success (ground pad)')]

In [13]:
# Task 6: List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000.
%sql select distinct("Landing_Outcome") from SPACEXTABLE
# Success (drone ship)
%sql select distinct("Booster_Version") from SPACEXTABLE \
where "Landing_Outcome" = 'Success (drone ship)' AND PAYLOAD_MASS__KG_ > 4000 AND PAYLOAD_MASS__KG_ < 6000

 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

In [14]:
# Task 7: List the total number of successful and failure mission outcomes.
%sql select "Mission_Outcome", count(*) as my_count from SPACEXTABLE \
   group by "Mission_Outcome"

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

In [15]:
# Task 8: List the names of the booster_versions which have carried the maximum payload mass. Use a subquery.

%sql select "Booster_Version" from SPACEXTABLE where \
PAYLOAD_MASS__KG_ in (select max(PAYLOAD_MASS__KG_) from SPACEXTABLE)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

In [16]:
# List the records which will display the month names, failure landing_outcomes in drone ship, 
# booster versions, launch_site for the months in year 2015.
# Failure (drone ship)
# **Note: SQLLite does not support monthnames. 
# So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**
%sql select substr(Date, 6, 2), "Landing_Outcome", "Booster_Version", "Launch_Site" from SPACEXTABLE \
   where "Landing_Outcome" = 'Failure (drone ship)' and substr(Date, 0, 5)='2015'

 * sqlite:///my_data1.db
Done.

[('01', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

In [17]:
# Task 10: Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) 
# between the date 2010-06-04 and 2017-03-20, in descending order. 

%sql select Date, "Landing_Outcome" from SPACEXTABLE where \
   "Landing_Outcome" = 'Failure (drone ship)' and Date between '2010-06-04' and '2017-03-20' \
   order by Date desc

 * sqlite:///my_data1.db
Done.

[('2016-06-15', 'Failure (drone ship)'),
 ('2016-03-04', 'Failure (drone ship)'),
 ('2016-01-17', 'Failure (drone ship)'),
 ('2015-04-14', 'Failure (drone ship)'),
 ('2015-01-10', 'Failure (drone ship)')]

In [18]:
%sql select distinct("Launch_Site") from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]